src/controllers/ContactsController.php

SELECT * FROM `contacts` WHERE `id`='17'
---
    protected function findModel($id)
    {
        if (($model = Contacts::findOne($id)) !== null) {