src/components/SidebarWidget.php

	public function getRandomContact()
    {
		$query = new Query;
		$query->select('*')
			->from('contacts')
			->orderBy('RAND()')
			->limit(1);

		$rows = $query->one();
---
SELECT * FROM `contacts` ORDER BY RAND() LIMIT 1